### Pandas-Dataframe And Series

Pandas is a powerfull data manipulation library in python,widely used for data analysis and data cleaning. It providdes two primary data structures: Series and DataFrame. A series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes(rows and columns).

In [3]:

!pip install pandas

Requirement already satisfied: pandas in c:\users\91784\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\91784\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\91784\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\91784\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\91784\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\91784\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

Collecting pandas
  Downloading pandas-2.3.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\users\91784\desktop\data science\venv\lib\site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\91784\desktop\data science\venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.3-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\91784\desktop\data science\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp312-cp312-win_amd64.whl (11.0 MB)
   ---------------------------------------- 0.0/11.0 MB ? eta -:--:--
    --------------------------------------- 0.3/11.0 MB ? eta -:--:--
   -- ------------------------------------- 0.8/11.0 MB 2.4 MB/s eta 0:00:05
   --- ------------------------------------ 1.0/11.0 MB 2.2 MB/s eta 0:00:05
   ----- ---------------------------------- 1.6/11.0 MB 2.0 MB/s eta 0:00:05
   ------ --------------------------------- 1.8/11.0 MB 1.9 MB/s eta 0:00:05
   -------- ------------------------------- 2.4/11.0 MB 1.9 MB/s eta 0:00:05
   ---------- ----------------------------- 2.9/11.0 MB 2.1 MB/s eta 0:00:04
   ------------ --------------------------- 3.4/11.0 MB 2.1 MB/s eta 0:00:04
   --------------- ------------------------ 4.2/11.0 MB 2.3 MB/s eta 0:00:03
   ----------------- ---------------------- 4.7/11.0 MB 2.3 MB/s eta 0:00:03
   ------------------ --------------------- 5.0/11.0 MB 2.3 MB/s eta 0:00:03
   ------------------ --------------------- 5.0/11.0 MB 2.3 MB/s eta 0:00:03
   ------------------- -------------------- 5.2/11.0 MB 2.0 MB/s eta 0:00:03
   --------------------- ------------------ 6.0/11.0 MB 2.1 MB/s eta 0:00:03
   ---------------------- ----------------- 6.3/11.0 MB 2.0 MB/s eta 0:00:03
   ----------------------- ---------------- 6.6/11.0 MB 2.0 MB/s eta 0:00:03
   ------------------------ --------------- 6.8/11.0 MB 2.0 MB/s eta 0:00:03
   -------------------------- ------------- 7.3/11.0 MB 1.9 MB/s eta 0:00:02
   -------------------------- ------------- 7.3/11.0 MB 1.9 MB/s eta 0:00:02
   -------------------------- ------------- 7.3/11.0 MB 1.9 MB/s eta 0:00:02
   ---------------------------- ----------- 7.9/11.0 MB 1.8 MB/s eta 0:00:02
   ------------------------------ --------- 8.4/11.0 MB 1.8 MB/s eta 0:00:02
   ------------------------------- -------- 8.7/11.0 MB 1.8 MB/s eta 0:00:02
   -------------------------------- ------- 8.9/11.0 MB 1.7 MB/s eta 0:00:02
   --------------------------------- ------ 9.2/11.0 MB 1.7 MB/s eta 0:00:02
   ---------------------------------- ----- 9.4/11.0 MB 1.7 MB/s eta 0:00:01
   ------------------------------------ --- 10.0/11.0 MB 1.7 MB/s eta 0:00:01
   ------------------------------------- -- 10.2/11.0 MB 1.7 MB/s eta 0:00:01
   ---------------------------------------  10.7/11.0 MB 1.7 MB/s eta 0:00:01
   ---------------------------------------- 11.0/11.0 MB 1.7 MB/s  0:00:06
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.3-py2.py3-none-any.whl (348 kB)
Installing collected packages: pytz, tzdata, pandas

   ---------------------------------------- 0/3 [pytz]
   ---------------------------------------- 0/3 [pytz]
   ---------------------------------------- 0/3 [pytz]
   ---------------------------------------- 0/3 [pytz]
   ---------------------------------------- 0/3 [pytz]
   ---------------------------------------- 0/3 [pytz]
   ---------------------------------------- 0/3 [pytz]
   ---------------------------------------- 0/3 [pytz]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]

In [4]:
import pandas as pd

In [7]:
## SERIES 
# A Pandas series is a one-dimensional array like obkject that can hold any data type. It is similar as column in a table

data = [1,2,3,4,5]
series = pd.Series(data)
print("Series: \n",series) # Here default index is: 0,1,2,3,4...
print(type(series))

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
## Create a series form dictionary
data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict) # Here indexes are a,b,c
# Keys from dict treated as Index, values are treated as Series

a    1
b    2
c    3
dtype: int64

In [10]:
# We can also achive the Dictionary like custom indexes without using dictionary
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [15]:
## DataFrame
## Creae A Dataframe from a dictionary of List

data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New york','Florida']
}

dataFrame = pd.DataFrame(data)
print(dataFrame)
print(type(dataFrame))

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New york
2   Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [21]:
# Read a CSV file
df = pd.read_csv('students_practice_pandas.csv')
# print(df.head)
df.head(5)
df.tail(5)

   student_id    name branch  year  cgpa placement_status
5         106  Anjali    CSE     3   8.8           Placed
6         107   Rohit    ECE     1   7.5       Not Placed
7         108    Neha     ME     4   6.7       Not Placed
8         109   Vikas     EE     2   7.9           Placed
9         110   Pooja    CSE     1   9.3           Placed

In [27]:
df = pd.DataFrame(data)
df['Name'] #When We only choose one column then the data frame becomes series.
print(type(df['Name'])) #O/P: <class 'pandas.core.series.Series'>

<class 'pandas.core.series.Series'>

In [36]:
df.loc[2] #Chooose Particular row
df.iloc[2] #Choose Index Location

Name       Jack
Age          45
City    Florida
Name: 2, dtype: object

In [41]:
# Accessing a specified element
print(df.at[1,'Name'])

John

In [46]:
print(df.iat[2,2])

Florida

In [47]:
# Data Manipulation with Dataframe
df

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New york
2   Jack   45    Florida

In [62]:
# Adding a salary column
df['Salary'] = [50000,60000,70000]
df

    Name  Age       City  Salary
0  Krish   25  Bangalore   50000
1   John   30   New york   60000
2   Jack   45    Florida   70000

In [69]:
# Delete a column
df.drop('Salary',axis=1) # By Axis = 1 it will temporarily delete the column but not permanently.
# To delete it permanently, 
df.drop('Salary',axis=1,inplace=True)

In [74]:
# Add age to the column
df['Age'] = df['Age']+1
df

    Name  Age       City
0  Krish   28  Bangalore
1   John   33   New york
2   Jack   48    Florida

In [ ]:
df.drop(0,inplace=True)  # It will delete the 0th Row from the dataframe

In [82]:
df = pd.read_csv('students_practice_pandas.csv')
# print(df.describe())
df.describe()

       student_id       year       cgpa
count    10.00000  10.000000  10.000000
mean    105.50000   2.300000   7.970000
std       3.02765   1.159502   0.920205
min     101.00000   1.000000   6.700000
25%     103.25000   1.250000   7.275000
50%     105.50000   2.000000   7.850000
75%     107.75000   3.000000   8.725000
max     110.00000   4.000000   9.300000

### Data Manipulation With Pandas And Numpy

In [19]:
import pandas as pd

df = pd.read_csv('employess_data.csv')
# df.head(15)
# Handling Missing Values
# df.isnull().any(axis=1)
df.isnull().sum() 
#isnull() returns a DataFrame (or Series) of boolean values where True indicates a missing (null/NaN) value and False indicates a non-null value.
#isnull().sum() : When applied after isnull(), sum() counts the number of missing values (True) in each column (by default).
# #Because:
# True → 1
# False → 0

EmployeeID     0
Name           1
Age            2
Department     1
Salary         2
Experience     1
City           1
JoiningDate    1
dtype: int64

## ffill() vs fillna()

# ffill: 
-  ffill (forward fill) is a method/strategy used to fill missing values using the previous valid value.
-  It is not a standalone function.
-  It is used inside fillna() (or via .ffill() shortcut).

# fillna: 
- fillna() is a pandas function used to replace missing values using a value or a method (like ffill, bfill).

In [22]:
## Filling missing values with 0
df_filled = df.fillna(0)
df_filled

,EmployeeID,Name,Age,Department,Salary,Experience,City,JoiningDate
0,101,Amit,25.0,IT,45000.0,2.0,Bangalore,2022-06-15
1,102,Riya,29.0,HR,50000.0,4.0,Mumbai,2021-03-10
2,103,Rahul,0.0,Finance,60000.0,5.0,Delhi,2020-11-01
3,104,Neha,32.0,IT,0.0,7.0,Bangalore,2018-07-23
4,105,0,28.0,Marketing,48000.0,3.0,Chennai,2022-01-05
5,106,Suresh,35.0,Finance,75000.0,0.0,Hyderabad,2016-09-17
6,107,Anjali,26.0,HR,42000.0,1.0,0,2023-02-20
7,108,Vikram,41.0,IT,90000.0,15.0,Pune,0
8,109,Priya,0.0,Marketing,0.0,6.0,Mumbai,2019-05-30
9,110,Arjun,30.0,0,55000.0,5.0,Bangalore,2020-12-12

In [24]:
## filling missing values with the mean of the column 
df['Age_fillNa'] = df['Age'].fillna(df['Age'].mean())
## First we go to the Age column, then in that column we fill the NaN values present in that column with mean values of Age column
df

,EmployeeID,Name,Age,Department,Salary,Experience,City,JoiningDate,Age_fillNa
0,101,Amit,25.0,IT,45000.0,2.0,Bangalore,2022-06-15,25.00
1,102,Riya,29.0,HR,50000.0,4.0,Mumbai,2021-03-10,29.00
2,103,Rahul,NaN,Finance,60000.0,5.0,Delhi,2020-11-01,30.75
3,104,Neha,32.0,IT,NaN,7.0,Bangalore,2018-07-23,32.00
4,105,NaN,28.0,Marketing,48000.0,3.0,Chennai,2022-01-05,28.00
5,106,Suresh,35.0,Finance,75000.0,NaN,Hyderabad,2016-09-17,35.00
6,107,Anjali,26.0,HR,42000.0,1.0,NaN,2023-02-20,26.00
7,108,Vikram,41.0,IT,90000.0,15.0,Pune,NaN,41.00
8,109,Priya,NaN,Marketing,NaN,6.0,Mumbai,2019-05-30,30.75
9,110,Arjun,30.0,NaN,55000.0,5.0,Bangalore,2020-12-12,30.00

In [27]:
# Renaming columns
df = df.rename(columns={'Name':'First Name'})
df.head()

,EmployeeID,First Name,Age,Department,Salary,Experience,City,JoiningDate,Age_fillNa
0,101,Amit,25.0,IT,45000.0,2.0,Bangalore,2022-06-15,25.00
1,102,Riya,29.0,HR,50000.0,4.0,Mumbai,2021-03-10,29.00
2,103,Rahul,NaN,Finance,60000.0,5.0,Delhi,2020-11-01,30.75
3,104,Neha,32.0,IT,NaN,7.0,Bangalore,2018-07-23,32.00
4,105,NaN,28.0,Marketing,48000.0,3.0,Chennai,2022-01-05,28.00

In [31]:
## Change datatypes
df['Salary_New'] = df['Salary'].fillna(df['Salary'].mean()).astype(int) 
# Here I have used the fillna cause there is NaN values(null values) present in the Salary column.
df.head()

,EmployeeID,First Name,Age,Department,Salary,Experience,City,JoiningDate,Age_fillNa,Salary_New
0,101,Amit,25.0,IT,45000.0,2.0,Bangalore,2022-06-15,25.00,45000
1,102,Riya,29.0,HR,50000.0,4.0,Mumbai,2021-03-10,29.00,50000
2,103,Rahul,NaN,Finance,60000.0,5.0,Delhi,2020-11-01,30.75,60000
3,104,Neha,32.0,IT,NaN,7.0,Bangalore,2018-07-23,32.00,58125
4,105,NaN,28.0,Marketing,48000.0,3.0,Chennai,2022-01-05,28.00,48000

In [32]:
df['New Age'] = df['Age'].apply(lambda x : x*2)
# By this .apply() we can actually use any functions inside this .apply().
df

,EmployeeID,First Name,Age,Department,Salary,Experience,City,JoiningDate,Age_fillNa,Salary_New,New Age
0,101,Amit,25.0,IT,45000.0,2.0,Bangalore,2022-06-15,25.00,45000,50.0
1,102,Riya,29.0,HR,50000.0,4.0,Mumbai,2021-03-10,29.00,50000,58.0
2,103,Rahul,NaN,Finance,60000.0,5.0,Delhi,2020-11-01,30.75,60000,NaN
3,104,Neha,32.0,IT,NaN,7.0,Bangalore,2018-07-23,32.00,58125,64.0
4,105,NaN,28.0,Marketing,48000.0,3.0,Chennai,2022-01-05,28.00,48000,56.0
5,106,Suresh,35.0,Finance,75000.0,NaN,Hyderabad,2016-09-17,35.00,75000,70.0
6,107,Anjali,26.0,HR,42000.0,1.0,NaN,2023-02-20,26.00,42000,52.0
7,108,Vikram,41.0,IT,90000.0,15.0,Pune,NaN,41.00,90000,82.0
8,109,Priya,NaN,Marketing,NaN,6.0,Mumbai,2019-05-30,30.75,58125,NaN
9,110,Arjun,30.0,NaN,55000.0,5.0,Bangalore,2020-12-12,30.00,55000,60.0

## Important Point for grouping
- NaN salaries are automatically ignored in mean()
- If a city has all NaN salaries, result will be NaN
- Rows where City is NaN are excluded from grouping

In [39]:
## Data aggregating and grouping
grouped_mean = df.groupby('City')['Salary'].mean()
print(grouped_mean)

City
Bangalore    50000.0
Chennai      48000.0
Delhi        60000.0
Hyderabad    75000.0
Mumbai       50000.0
Pune         90000.0
Name: Salary, dtype: float64

In [42]:
# We can group by multiple values by passing them as a list
df.groupby(['City','Department'])['Salary'].mean()

City       Department
Bangalore  IT            45000.0
Chennai    Marketing     48000.0
Delhi      Finance       60000.0
Hyderabad  Finance       75000.0
Mumbai     HR            50000.0
           Marketing         NaN
Pune       IT            90000.0
Name: Salary, dtype: float64

In [45]:
## Multiple aggegate function
grouped_agg = df.groupby('Department')['Salary'].agg(['mean','sum','count'])
grouped_agg

               mean       sum  count
Department
Finance     67500.0  135000.0      2
HR          46000.0   92000.0      2
IT          67500.0  135000.0      2
Marketing   48000.0   48000.0      1

In [55]:
#Merging and joining dataFrames
# Create sample dataFrames

df1 = pd.DataFrame({'key': ['A','B','C'],'value1':[1,2,3]})
df2 = pd.DataFrame({'key': ['A','B','D'],'value2':[4,5,6]})

In [57]:
## Merge Dataframes on the 'Key Column'
pd.merge(df1,df2,on='key',how='inner')

  key  value1  value2
0   A       1       4
1   B       2       5

In [58]:
pd.merge(df1,df2,on='key',how='outer')

  key  value1  value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [59]:
pd.merge(df1,df2,on='key',how='left')

  key  value1  value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [60]:
pd.merge(df1,df2,on='key',how='right')

  key  value1  value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6